---
title: ExportFontTableIterator
classe: Autodesk.Revit.DB.ExportFontTableIterator
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ExportFontTableIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `KeyValuePair<ExportFontKey, ExportFontInfo> Current { get; }` | `exportFontTableIterator.Current` | KeyValuePair<ExportFontKey, ExportFontInfo> |
| `Boolean IsValidObject { get; }` | `exportFontTableIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `exportFontTableIterator.Dispose()` | Void |
| `Boolean IsDone()` | `exportFontTableIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `exportFontTableIterator.MoveNext()` | Boolean |
| `Void Reset()` | `exportFontTableIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```